<?php
declare (strict_types = 1);
// +----------------------------------------------------------------------
// | 胜家云 [ SingKa Cloud ]
// +----------------------------------------------------------------------
// | Copyright (c) 2016~2021 https://www.singka.cloud All rights reserved.
// +----------------------------------------------------------------------
// | 宁波晟嘉网络科技有限公司
// +----------------------------------------------------------------------
// | Author: 夏慧新 <shycomet@163.com>
// +----------------------------------------------------------------------
// | 创建于2021年09月19日 06:17
// +----------------------------------------------------------------------
// | Format.php
// +----------------------------------------------------------------------

namespace DustInk\Tools;


class Format
{
    /**
     * 数组重新序列化
     * @param array $arr
     * @return array
     */
    static public function restoreArray(array $arr)
    {
        if (!is_array($arr)) {
            return $arr;
        } else {
            $c = 0;
            $newArr = [];
            foreach ($arr as $key => $value) {
                $newArr[$c] = $value;
                $c++;
            }
            return $newArr;
        }
    }
}